Repository: helix-global/bsdk-a
Catalog: src/dotnet/assemblies/BinaryStudio.Security.Cryptography.AbstractSyntaxNotation/Properties/OID.*.resx
Languages: ru_ru

# 0.4.0.1862.1.1
source: European Qualified Certificate
ru_ru: Сертификат европейского образца

# 0.4.0.1862.1.4
source: Secure Signature Creation Device Qualified Certificate
ru_ru: Сертификат устройства создания безопасной подписи

# 1.2.840.113549.1.7.1
source: PKCS 7 Data
ru_ru: Данные PKCS 7

# 1.2.840.113549.1.7.2
source: PKCS 7 Signed
ru_ru: Подписан PKCS 7

# 1.2.840.113549.1.7.3
source: PKCS 7 Enveloped
ru_ru: Запечатан PKCS 7

# 1.2.840.113549.1.7.4
source: PKCS 7 Signed Enveloped
ru_ru: Подписан и запечатан PKCS 7

# 1.2.840.113549.1.7.5
source: PKCS 7 Digested
ru_ru: Сделан дайджест PKCS 7

# 1.2.840.113549.1.7.6
source: PKCS 7 Encrypted
ru_ru: Зашифрован PKCS 7

# 1.2.840.113549.1.9.1
source: Email Address
ru_ru: Электронный адрес

# 1.2.840.113549.1.9.14
source: Certificate Extensions
ru_ru: Расширения сертификатов

# 1.2.840.113549.1.9.15
source: SMIME Capabilities
ru_ru: Возможности SMIME

# 1.2.840.113549.1.9.15.1
source: Prefer Signed Data
ru_ru: Предпочтение подписанных данных

# 1.2.840.113549.1.9.2
source: Unstructured Name
ru_ru: Неструктурированное имя

# 1.2.840.113549.1.9.3
source: Content Type
ru_ru: Тип содержимого

# 1.2.840.113549.1.9.4
source: Message Digest
ru_ru: Выборка сообщения

# 1.2.840.113549.1.9.5
source: Signing Time
ru_ru: Время подписи

# 1.2.840.113549.1.9.6
source: Counter Sign
ru_ru: Подпись счетчика

# 1.2.840.113549.1.9.7
source: Challenge Password
ru_ru: Пароль вызова

# 1.2.840.113549.1.9.8
source: Unstructured Addresss
ru_ru: Неструктурированный адрес

# 1.2.840.113549.2.2
source: MD2
ru_ru: Функция хэширования MD2

# 1.2.840.113549.2.4
source: MD4
ru_ru: Функция хэширования MD4

# 1.2.840.113549.2.5
source: MD5
ru_ru: Функция хэширования MD5

# 1.3.6.1.5.5.7.48.1.5
source: OCSP No Revocation Checking
ru_ru: НЕ проверять отзыв OCSP

# 1.3.14.3.2.18
source: SHA
ru_ru: Функция хэширования SHA

# 1.3.14.3.2.26
source: SHA1
ru_ru: Функция хэширования SHA1

# 1.3.6.1.4.1.311.10.2
source: Next Update Location
ru_ru: Размещение следующего обновления

# 1.3.6.1.4.1.311.2.1.14
source: Certificate Extensions
ru_ru: Расширения сертификатов

# 1.3.6.1.4.1.311.10.3.1
source: Microsoft Trust List Signing
ru_ru: Подписывание списка доверия (Microsoft)

# 1.3.6.1.4.1.311.10.3.2
source: Microsoft Time Stamping
ru_ru: Установка отметки времени (Microsoft)

# 1.3.6.1.4.1.311.10.3.3.1
source: Serialized Signature Serial Number
ru_ru: Серийный номер сериализованной подписи

# 1.3.6.1.4.1.311.10.3.4
source: Encrypting File System
ru_ru: Шифрующая файловая система (EFS)

# 1.3.6.1.4.1.311.10.3.4.1
source: File Recovery
ru_ru: Восстановление файлов

# 1.3.6.1.4.1.311.10.3.5
source: Windows Hardware Driver Verification
ru_ru: Проверка драйверов оборудования Windows

# 1.3.6.1.4.1.311.10.3.6
source: Windows System Component Verification
ru_ru: Проверяет системные компоненты Windows

# 1.3.6.1.4.1.311.10.3.7
source: OEM Windows System Component Verification
ru_ru: Проверка системных компонентов OEM Windows

# 1.3.6.1.4.1.311.10.3.8
source: Embedded Windows System Component Verification
ru_ru: Встроенная проверка системных компонентов Windows

# 1.3.6.1.4.1.311.10.3.9
source: Root List Signer
ru_ru: Подпись корневого списка

# 1.3.6.1.4.1.311.10.3.10
source: Qualified Subordination
ru_ru: Квалифицированное подчинение

# 1.3.6.1.4.1.311.10.3.11
source: Key Recovery
ru_ru: Восстановление ключа

# 1.3.6.1.4.1.311.10.3.12
source: Document Signing
ru_ru: Подписывание документа

# 1.3.6.1.4.1.311.10.4.1
source: Yes or No Trust
ru_ru: Да или нет доверию

# 1.3.6.1.4.1.311.10.5.1
source: Digital Rights
ru_ru: Цифровые права

# 1.3.6.1.4.1.311.10.6.1
source: Key Pack Licenses
ru_ru: Лицензии пакета ключей

# 1.3.6.1.4.1.311.10.6.2
source: License Server Verification
ru_ru: Проверка сервера лицензий

# 1.3.6.1.4.1.311.10.9.1
source: Cross-Certificate Distribution Points
ru_ru: Точки распространения перекрестных сертификатов

# 1.3.6.1.4.1.311.10.1
source: Certifcate Trust List
ru_ru: Список доверия сертификатов

# 1.3.6.1.4.1.311.10.10.1
source: CMC Attributes
ru_ru: Атрибуты CMC

# 1.3.6.1.4.1.311.10.12.1
source: All application policies
ru_ru: Все политики применения

# 1.3.6.1.4.1.311.13.2.1
source: Enrollment Name Value Pair
ru_ru: Пара имени и значения заявки

# 1.3.6.1.4.1.311.13.2.2
source: Enrollment CSP
ru_ru: CSP подачи заявок

# 1.3.6.1.4.1.311.13.2.3
source: OS Version
ru_ru: Версия ОС

# 1.3.6.1.4.1.311.20.1
source: CTL Usage
ru_ru: Использование списка доверия сертификатов

# 1.3.6.1.4.1.311.20.2
source: Certificate Template Name
ru_ru: Имя шаблона сертификата

# 1.3.6.1.4.1.311.20.2.1
source: Certificate Request Agent
ru_ru: Агент запроса сертификата

# 1.3.6.1.4.1.311.20.2.2
source: Smart Card Logon
ru_ru: Вход со смарт-картой

# 1.3.6.1.4.1.311.20.2.3
source: Principal Name
ru_ru: Имя участника

# 1.3.6.1.4.1.311.20.3
source: Certificate Manifold
ru_ru: Размножение сертификата

# 1.3.6.1.4.1.311.21.1
source: CA Version
ru_ru: Версия ЦС

# 1.3.6.1.4.1.311.21.20
source: Client Information
ru_ru: Сведения о клиенте

# 1.3.6.1.4.1.311.25.1
source: DS Object Guid
ru_ru: GUID объекта DS

# 1.3.6.1.4.1.311.31.1
source: Windows Product Update
ru_ru: Обновление продукта Windows

# 1.3.6.1.5.5.7.1.1
source: Authority Information Access
ru_ru: Доступ к информации о центрах сертификации

# 1.3.6.1.5.5.7.12.2
source: CMC Data
ru_ru: Данные CMC

# 1.3.6.1.5.5.7.2.1
source: OID for CPS qualifier
ru_ru: CPS

# 1.3.6.1.5.5.7.2.2
source: User Notice
ru_ru: Уведомление пользователя

# 1.3.6.1.5.5.7.3.1
source: Server Authentication
ru_ru: Проверка подлинности сервера

# 1.3.6.1.5.5.7.3.2
source: Client Authentication
ru_ru: Проверка подлинности клиента

# 1.3.6.1.5.5.7.3.3
source: Code Signing
ru_ru: Подписывание кода

# 1.3.6.1.5.5.7.3.4
source: Secure Email
ru_ru: Защищенная электронная почта

# 1.3.6.1.5.5.7.3.5
source: IP security end system
ru_ru: Конечная система IP-безопасности

# 1.3.6.1.5.5.7.3.6
source: IP security tunnel termination
ru_ru: Окончание туннеля IP-безопасности

# 1.3.6.1.5.5.7.3.7
source: IP security user
ru_ru: Пользователь IP-безопасности

# 1.3.6.1.5.5.7.3.8
source: Time Stamping
ru_ru: Установка отметки времени

# 1.3.6.1.5.5.7.48.1
source: On-line Certificate Status Protocol
ru_ru: Протокол определения состояния сертификата через сеть

# 1.3.6.1.5.5.7.48.2
source: Certification Authority Issuer
ru_ru: Поставщик центра сертификации

# 2.16.840.1.113730.1.1
source: Netscape Cert Type
ru_ru: Тип сертификата Netscape

# 2.16.840.1.113730.1.12
source: Netscape SSL ServerName
ru_ru: Имя SSL-сервера Netscape

# 2.16.840.1.113730.1.13
source: Netscape Comment
ru_ru: Комментарий Netscape

# 2.16.840.1.113730.1.2
source: Netscape Base URL
ru_ru: Базовый URL Netscape

# 2.16.840.1.113730.1.3
source: Netscape Revocation URL
ru_ru: URL отзыва Netscape

# 2.16.840.1.113730.1.4
source: Netscape CA Revocation URL
ru_ru: URL отзыва ЦС Netscape

# 2.16.840.1.113730.1.7
source: Netscape Cert Renewal URL
ru_ru: URL обновления сертификатов Netscape

# 2.16.840.1.113730.1.8
source: Netscape CA Policy URL
ru_ru: URL политики ЦС Netscape

# 2.5.29.1
source: Authority Key Identifier
ru_ru: Идентификатор ключа центра сертификатов

# 2.5.29.10
source: Basic Constraints
ru_ru: Основные ограничения

# 2.5.29.14
source: Subject Key Identifier
ru_ru: Идентификатор ключа субъекта

# 2.5.29.15
source: Key Usage
ru_ru: Использование ключа

# 2.5.29.16
source: Private Key Usage Period
ru_ru: Период использования закрытого ключа

# 2.5.29.17
source: Subject Alternative Name
ru_ru: Дополнительное имя субъекта

# 2.5.29.18
source: Issuer Alternative Name
ru_ru: Дополнительное имя поставщика

# 2.5.29.19
source: Basic Constraints
ru_ru: Основные ограничения

# 2.5.29.2
source: Key Attributes
ru_ru: Атрибуты ключа

# 2.5.29.20
source: CRL Number
ru_ru: Номер CRL

# 2.5.29.21
source: CRL Reason Code
ru_ru: Код причины списка отзыва (CRL)

# 2.5.29.27
source: Delta CRL Indicator
ru_ru: Индикатор разностного CRL

# 2.5.29.28
source: Issuing Distribution Point
ru_ru: Точка распространения выдачи

# 2.5.29.30
source: Name Constraints
ru_ru: Ограничения имени

# 2.5.29.31
source: CRL Distribution Points
ru_ru: Точки распространения списков отзыва (CRL)

# 2.5.29.32
source: Certificate Policies
ru_ru: Политики сертификата

# 2.5.29.33
source: Policy Mappings
ru_ru: Сопоставления политики

# 2.5.29.35
source: Authority Key Identifier
ru_ru: Идентификатор ключа центра сертификатов

# 2.5.29.36
source: Policy Constraints
ru_ru: Ограничения политики

# 2.5.29.37
source: Enhanced Key Usage
ru_ru: Улучшенный ключ

# 2.5.29.4
source: Key Usage Restriction
ru_ru: Ограничение использования ключа

# 2.5.29.5
source: Policy Mappings
ru_ru: Сопоставления политики

# 2.5.29.7
source: Subject Alternative Name
ru_ru: Дополнительное имя субъекта

# 2.5.29.8
source: Issuer Alternative Name
ru_ru: Дополнительное имя поставщика

# 2.5.4.10
source: Organization Name
ru_ru: Организация

# 2.5.4.11
source: Organizational Unit Name
ru_ru: Название организационной единицы

# 2.5.4.12
source: Title
ru_ru: Заголовок

# 2.5.4.13
source: Description
ru_ru: Примечание

# 2.5.4.16
source: Postal Address
ru_ru: Почтовый адрес

# 2.5.4.17
source: Postal Code
ru_ru: Почтовый индекс

# 2.5.4.3
source: Common Name
ru_ru: Общее имя

# 2.5.4.4
source: Surname
ru_ru: Фамилия

# 2.5.4.42
source: Given Name
ru_ru: G

# 2.5.4.5
source: Serial Number
ru_ru: Серийный номер

# 2.5.4.6
source: Country Name
ru_ru: Страна

# 2.5.4.7
source: Locality Name
ru_ru: Город

# 2.5.4.8
source: State or Province Name
ru_ru: Область

# 2.5.4.9
source: Street Address
ru_ru: Улица

# 1.2.643.100.111
source: Subject's digital signing tool
ru_ru: Средство электронной подписи владельца

# 1.2.643.100.112
source: Issuer's digital signing tool
ru_ru: Средства электронной подписи и УЦ издателя

# 1.2.643.2.2.4
source: GOST R 34.10-94
ru_ru: Алгоритм цифровой подписи ГОСТ Р 34.10-94

# 1.2.643.2.2.9
source: GOST R 34.11-94
ru_ru: Функция хэширования ГОСТ Р 34.11-94

# 1.2.643.2.2.98
source: GOST R 34.10-2001 DH
ru_ru: Алгоритм Диффи-Хеллмана на базе эллиптической кривой

# 1.2.643.7.1.1.1.1
source: GOST R 34.10-2012 256 bit
ru_ru: Алгоритм ГОСТ Р 34.10-2012 для ключей длины 256 бит, используемый при экспорте/импорте ключей

# 1.2.643.7.1.1.1.2
source: GOST R 34.10-2012 512 bit
ru_ru: Алгоритм ГОСТ Р 34.10-2012 для ключей длины 512 бит, используемый при экспорте/импорте ключей

# 1.2.643.7.1.1.2.2
source: GOST R 34.11-2012 256 bit
ru_ru: Функция хэширования ГОСТ Р 34.11-2012, длина выхода 256 бит

# 1.2.643.7.1.1.2.3
source: GOST R 34.11-2012 512 bit
ru_ru: Функция хэширования ГОСТ Р 34.11-2012, длина выхода 512 бит

# 1.2.643.7.1.1.3.2
source: GOST R 34.11-2012/34.10-2012 256 bit
ru_ru: Алгоритм цифровой подписи ГОСТ Р 34.10-2012 для ключей длины 256 бит

# 1.2.643.7.1.1.3.3
source: GOST R 34.11-2012/34.10-2012 512 bit
ru_ru: Алгоритм цифровой подписи ГОСТ Р 34.10-2012 для ключей длины 512 бит

# 1.2.643.2.2.19
source: GOST R 34.10-2001
ru_ru: Алгоритм ГОСТ Р 34.10-2001, используемый при экспорте/импорте ключей

# 1.2.643.2.2.21
source: GOST 28147-89
ru_ru: Алгоритм шифрования ГОСТ 28147-89

# 1.2.643.2.2.3
source: GOST R 34.10/34.11-2001
ru_ru: Алгоритм цифровой подписи ГОСТ Р 34.10-2001

# 1.2.643.2.2.30.1
source: GOST R 3411-94 CryptoProParamSet
ru_ru: Узел замены функции хэширования по умолчанию, вариант "Верба-О"

# 1.2.643.2.2.30.2
source: GOST R 34.11-94, hash parameters 1
ru_ru: Узел замены функции хэширования, вариант 1

# 1.2.643.2.2.30.3
source: GOST R 34.11-94, hash parameters 2
ru_ru: Узел замены функции хэширования, вариант 2

# 1.2.643.2.2.30.4
source: GOST R 34.11-94, hash parameters 3
ru_ru: Узел замены функции хэширования, вариант 3

# 1.2.643.2.2.31.1
source: GOST 28147-89, default parameters
ru_ru: Узел замены алгоритма шифрования по умолчанию, вариант "Верба-О"

# 1.2.643.2.2.31.12
source: GOST 28147-89, cipher parameters TC26 A
ru_ru: Узел замены алгоритма шифрования, вариант ТК26 2

# 1.2.643.2.2.31.13
source: GOST 28147-89, cipher parameters TC26 B
ru_ru: Узел замены алгоритма шифрования, вариант ТК26 1

# 1.2.643.2.2.31.14
source: GOST 28147-89, cipher parameters TC26 C
ru_ru: Узел замены алгоритма шифрования, вариант ТК26 3

# 1.2.643.2.2.31.2
source: GOST 28147-89, cipher parameters 1
ru_ru: Узел замены алгоритма шифрования, вариант 1

# 1.2.643.2.2.31.3
source: GOST 28147-89, cipher parameters 2
ru_ru: Узел замены алгоритма шифрования, вариант 2

# 1.2.643.2.2.31.4
source: GOST 28147-89, cipher parameters 3
ru_ru: Узел замены алгоритма шифрования, вариант 3

# 1.2.643.2.2.31.5
source: GOST 28147-89, Oscar 1.1 parameters
ru_ru: Узел замены, вариант карты КриптоРИК

# 1.2.643.2.2.31.6
source: GOST 28147-89, Oscar 1.0 parameters
ru_ru: Узел замены, используемый при шифровании с хэшированием

# 1.2.643.2.2.34.1
source: TLS traffic audit
ru_ru: Аудит TLS-трафика

# 1.2.643.2.2.34.2
source: Registration Authority temporary access
ru_ru: Идентификация пользователя на центре регистрации

# 1.2.643.2.2.34.3
source: Internet server content signature
ru_ru: Подпись содержимого сервера Интернет

# 1.2.643.2.2.36.0
source: GOST R 3410-2001 CryptoPro-XchA
ru_ru: Параметры a, b, p, q, (x,y) алгоритма Диффи-Хеллмана на базе алгоритма ГОСТ Р 34.10-2001, вариант криптопровайдера. Используются те же параметры, что и с идентификатором 1.2.643.2.2.35.1 (Параметры a, b, p, q, (x,y) цифровой подписи и алгоритма Диффи-Хеллмана на базе алгоритма ГОСТ Р 34.10-2001, вариант криптопровайдера)

# 1.2.643.7.1.1.6.1
source: GOST R 34.10-2012 DH 256 bit
ru_ru: Алгоритм Диффи-Хеллмана на базе эллиптической кривой для ключей длины 256 бит

# 1.2.643.7.1.1.6.2
source: GOST R 34.10-2012 DH 512 bit
ru_ru: Алгоритм Диффи-Хеллмана на базе эллиптической кривой для ключей длины 512 бит

# 1.2.643.7.1.2.1.1.1
source: GOST R 34.10-2012 256 bit, parameters TC26 A
ru_ru: Параметры a, b, p, q, (x,y) цифровой подписи и алгоритма Диффи-Хеллмана на базе алгоритма ГОСТ Р 34.10-2012 256 бит, набор A

# 1.2.643.7.1.2.1.2.1
source: GOST R 34.10-2012 512 bit, default parameters
ru_ru: Параметры a, b, p, q, (x,y) цифровой подписи и алгоритма Диффи-Хеллмана на базе алгоритма ГОСТ Р 34.10-2012 512 бит по умолчанию

# 1.2.643.7.1.2.1.2.2
source: GOST R 34.10-2012 512 bit, parameters TC26 B
ru_ru: Параметры a, b, p, q, (x,y) цифровой подписи и алгоритма Диффи-Хеллмана на базе алгоритма ГОСТ Р 34.10-2012 512 бит, набор B

# 1.2.643.7.1.2.1.2.3
source: GOST R 34.10-2012 512 bit, parameters TC26 C
ru_ru: Параметры a, b, p, q, (x,y) цифровой подписи и алгоритма Диффи-Хеллмана на базе алгоритма ГОСТ Р 34.10-2012 512 бит, набор C

# 1.2.643.100.1
source: OGRN
ru_ru: ОГРН

# 1.2.643.3.131.1.1
source: INN
ru_ru: ИНН

# 2.5.29.32.0
source: Any Policy
ru_ru: Все политики выдачи

# 1.3.6.1.4.1.311.21.7
source: Certificate Template Information
ru_ru: Сведения о шаблоне сертификата

# 1.2.840.113549.1.1.11
source: SHA256 with RSA encryption
ru_ru: SHA256 с шифрованием RSA

# 2.16.840.1.101.3.4.2.1
source: SHA256
ru_ru: Функция хэширования SHA256

# 2.16.840.1.101.3.4.2.3
source: SHA512
ru_ru: Функция хэширования SHA512

# 1.3.6.1.4.1.311.21.4
source: Next CRL Publish
ru_ru: Дата следующей публикации CRL

# 1.3.6.1.4.1.311.21.14
source: Published CRL Locations
ru_ru: Размещения опубликованных CRL

# 2.16.862.2.2
source: PROCERT(National Register of Fiscal Identification (RIF))
ru_ru: PROCERT(Национальный регистр фискальной идентификации (RIF))
